
#include <wiringPi.h>
#include <stdio.h>
#include <string.h>
#include <wiringSerial.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <pthread.h>
#include <sys/types.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <sys/stat.h>
#include <fcntl.h>

/* 通过宏定义来替代数字，代码更加规范 */
#define VISITOR			 20
#define USER1  			 21
#define USER2            22
#define ADMINISTRATORS   23
#define OTHERUSERS       24
/* 真与假，在wiringPi库中已经定义 */
//#define TRUE 1
//#define FALSE 0

/* --------------------------------------------------------------------------------
 * 注册用户函数声明
 * --------------------------------------------------------------------------------
 * 2022/05/30	V1.0   杨皓清	        创建
 ---------------------------------------------------------------------------------- */
int registeredUserMain(void);

/* --------------------------------------------------------------------------------
 * 人脸识别函数声明
 * --------------------------------------------------------------------------------
 * 2022/05/24	V1.0   杨皓清	        创建
 ---------------------------------------------------------------------------------- */
int faceRecognitionMain(int numOfIdentity);

/* --------------------------------------------------------------------------------
 * 密码识别函数声明
 * --------------------------------------------------------------------------------
 * 2022/05/24	V1.0   杨皓清	        创建
 ---------------------------------------------------------------------------------- */
int passwordRecognitionMain(int numOfIdentity);

/* --------------------------------------------------------------------------------
 * APP识别函数声明
 * --------------------------------------------------------------------------------
 * 2022/05/24	V1.0   杨皓清	        创建
 ---------------------------------------------------------------------------------- */
/* App验证 */
int AppRecognitionMain(int numOfIdentity);





